ahtn/keyplus/efm8/efm8/mcu/C8051T321/inc/SI_C8051T321_Register_Enums.h
#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control                           
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt set to low priority level.                 
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt set to high priority level.                
                                                                                               
#define IP_PS0__BMASK   0x10 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__SHIFT   0x04 ///< UART0 Interrupt Priority Control                             
#define IP_PS0__LOW     0x00 ///< UART0 interrupt set to low priority level.                   
#define IP_PS0__HIGH    0x10 ///< UART0 interrupt set to high priority level.                  
                                                                                               
#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control                           
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt set to low priority level.                 
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt set to high priority level.                
                                                                                               
#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt set to low priority level.                    
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt set to high priority level.                   
                                                                                               
//------------------------------------------------------------------------------
// OSCLCN Enums (Internal Low Frequency Oscillator Control @ 0x86)
//------------------------------------------------------------------------------
#define OSCLCN_OSCLD__FMASK       0x03 ///< Divider Select                                   
#define OSCLCN_OSCLD__SHIFT       0x00 ///< Divider Select                                   
#define OSCLCN_OSCLD__LFOSC_DIV_8 0x00 ///< Divide by 8 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_4 0x01 ///< Divide by 4 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_2 0x02 ///< Divide by 2 selected.                            
#define OSCLCN_OSCLD__LFOSC_DIV_1 0x03 ///< Divide by 1 selected.                            
                                                                                             
#define OSCLCN_OSCLF__FMASK       0x3C ///< Frequency Control Value                          
#define OSCLCN_OSCLF__SHIFT       0x02 ///< Frequency Control Value                          
                                                                                             
#define OSCLCN_OSCLRDY__BMASK     0x40 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__SHIFT     0x06 ///< Oscillator Ready Flag                            
#define OSCLCN_OSCLRDY__NOT_SET   0x00 ///< Low Frequency Oscillator frequency is not stable.
#define OSCLCN_OSCLRDY__SET       0x40 ///< Low Frequency Oscillator frequency is stable.    
                                                                                             
#define OSCLCN_OSCLEN__BMASK      0x80 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__SHIFT      0x07 ///< Oscillator Enable                                
#define OSCLCN_OSCLEN__DISABLED   0x00 ///< Disable the Low Frequency Oscillator.            
#define OSCLCN_OSCLEN__ENABLED    0x80 ///< Enable the Low Frequency Oscillator.             
                                                                                             
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK     0x01 ///< UART0 I/O Output Enable                        
#define XBR0_URT0E__SHIFT     0x00 ///< UART0 I/O Output Enable                        
#define XBR0_URT0E__DISABLED  0x00 ///< UART0 I/O unavailable at Port pin.             
#define XBR0_URT0E__ENABLED   0x01 ///< UART0 TX, RX routed to Port pins P0.4 and P0.5.
                                                                                       
#define XBR0_SPI0E__BMASK     0x02 ///< SPI I/O Enable                                 
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI I/O Enable                                 
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.              
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be    
                                   ///< assigned either 3 or 4 GPIO pins.              
                                                                                       
#define XBR0_SMB0E__BMASK     0x04 ///< SMBus0 I/O Enable                              
#define XBR0_SMB0E__SHIFT     0x02 ///< SMBus0 I/O Enable                              
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus0 I/O unavailable at Port pins.           
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus0 I/O routed to Port pins.                
                                                                                       
#define XBR0_SYSCKE__BMASK    0x08 ///< SYSCLK Output Enable                           
#define XBR0_SYSCKE__SHIFT    0x03 ///< SYSCLK Output Enable                           
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.                
#define XBR0_SYSCKE__ENABLED  0x08 ///< SYSCLK output routed to Port pin.              
                                                                                       
#define XBR0_CP0E__BMASK      0x10 ///< Comparator0 Output Enable                      
#define XBR0_CP0E__SHIFT      0x04 ///< Comparator0 Output Enable                      
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.                   
#define XBR0_CP0E__ENABLED    0x10 ///< CP0 routed to Port pin.                        
                                                                                       
#define XBR0_CP0AE__BMASK     0x20 ///< Comparator0 Asynchronous Output Enable         
#define XBR0_CP0AE__SHIFT     0x05 ///< Comparator0 Asynchronous Output Enable         
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.      
#define XBR0_CP0AE__ENABLED   0x20 ///< Asynchronous CP0 routed to Port pin.           
                                                                                       
