ahtn/keyplus/efm8/efm8/mcu/C8051T321/inc/SI_C8051T321_Register_Enums.h
#define TMR2CN_TF2H__BMASK            0x80 ///< Timer 2 High Byte Overflow Flag                  
#define TMR2CN_TF2H__SHIFT            0x07 ///< Timer 2 High Byte Overflow Flag                  
#define TMR2CN_TF2H__NOT_SET          0x00 ///< Timer 2 8-bit high byte or 16-bit value did not  
                                           ///< overflow.                                        
#define TMR2CN_TF2H__SET              0x80 ///< Timer 2 8-bit high byte or 16-bit value          
                                           ///< overflowed.                                      
                                                                                                 
//------------------------------------------------------------------------------
// TMR2H Enums (Timer 2 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR2H_TMR2H__FMASK 0xFF ///< Timer 2 High Byte
#define TMR2H_TMR2H__SHIFT 0x00 ///< Timer 2 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR2L Enums (Timer 2 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR2L_TMR2L__FMASK 0xFF ///< Timer 2 Low Byte
#define TMR2L_TMR2L__SHIFT 0x00 ///< Timer 2 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR2RLH Enums (Timer 2 Reload High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define TMR2RLH_TMR2RLH__FMASK 0xFF ///< Timer 2 Reload High Byte
#define TMR2RLH_TMR2RLH__SHIFT 0x00 ///< Timer 2 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR2RLL Enums (Timer 2 Reload Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define TMR2RLL_TMR2RLL__FMASK 0xFF ///< Timer 2 Reload Low Byte
#define TMR2RLL_TMR2RLL__SHIFT 0x00 ///< Timer 2 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// TMR3CN Enums (Timer 3 Control @ 0x91)
//------------------------------------------------------------------------------
#define TMR3CN_T3XCLK__BMASK          0x01 ///< Timer 3 External Clock Select                    
#define TMR3CN_T3XCLK__SHIFT          0x00 ///< Timer 3 External Clock Select                    
#define TMR3CN_T3XCLK__SYSCLK_DIV_12  0x00 ///< Timer 3 clock is the system clock divided by 12. 
#define TMR3CN_T3XCLK__EXTOSC_DIV_8   0x01 ///< Timer 3 clock is the external oscillator divided 
                                           ///< by 8 (synchronized with SYSCLK).                 
                                                                                                 
#define TMR3CN_T3CSS__BMASK           0x02 ///< Timer 3 Capture Source Select                    
#define TMR3CN_T3CSS__SHIFT           0x01 ///< Timer 3 Capture Source Select                    
#define TMR3CN_T3CSS__USB_SOF_CAPTURE 0x00 ///< Capture source is USB SOF event.                 
#define TMR3CN_T3CSS__LFOSC_CAPTURE   0x02 ///< Capture source is falling edge of Low-Frequency  
                                           ///< Oscillator.                                      
                                                                                                 
#define TMR3CN_TR3__BMASK             0x04 ///< Timer 3 Run Control                              
#define TMR3CN_TR3__SHIFT             0x02 ///< Timer 3 Run Control                              
#define TMR3CN_TR3__STOP              0x00 ///< Stop Timer 3.                                    
#define TMR3CN_TR3__RUN               0x04 ///< Start Timer 3 running.                           
                                                                                                 
#define TMR3CN_T3SPLIT__BMASK         0x08 ///< Timer 3 Split Mode Enable                        
#define TMR3CN_T3SPLIT__SHIFT         0x03 ///< Timer 3 Split Mode Enable                        
#define TMR3CN_T3SPLIT__16_BIT_RELOAD 0x00 ///< Timer 3 operates in 16-bit auto-reload mode.     
#define TMR3CN_T3SPLIT__8_BIT_RELOAD  0x08 ///< Timer 3 operates as two 8-bit auto-reload timers.
                                                                                                 
#define TMR3CN_TF3CEN__BMASK          0x10 ///< Timer 3 Capture Enable                           
#define TMR3CN_TF3CEN__SHIFT          0x04 ///< Timer 3 Capture Enable                           
#define TMR3CN_TF3CEN__DISABLED       0x00 ///< Disable capture mode.                            
#define TMR3CN_TF3CEN__ENABLED        0x10 ///< Enable capture mode.                             
                                                                                                 
#define TMR3CN_TF3LEN__BMASK          0x20 ///< Timer 3 Low Byte Interrupt Enable                
#define TMR3CN_TF3LEN__SHIFT          0x05 ///< Timer 3 Low Byte Interrupt Enable                
#define TMR3CN_TF3LEN__DISABLED       0x00 ///< Disable low byte interrupts.                     
#define TMR3CN_TF3LEN__ENABLED        0x20 ///< Enable low byte interrupts.                      
                                                                                                 
#define TMR3CN_TF3L__BMASK            0x40 ///< Timer 3 Low Byte Overflow Flag                   
#define TMR3CN_TF3L__SHIFT            0x06 ///< Timer 3 Low Byte Overflow Flag                   
#define TMR3CN_TF3L__NOT_SET          0x00 ///< Timer 3 low byte did not overflow.               
#define TMR3CN_TF3L__SET              0x40 ///< Timer 3 low byte overflowed.                     
                                                                                                 
